In [19]:
import numpy as np
import pandas as pd
import statistics
from scipy import stats
import math

In [20]:
data = np.array(
    [
        150,
        151,
        152,
        152,
        153,
        154,
        155,
        155,
        155,
        155,
        156,
        156,
        156,
        157,
        158,
        158,
        160,
        160,
        160,
        160,
        160,
        161,
        161,
        161,
        161,
        162,
        163,
        163,
        164,
        164,
        164,
        165,
        166,
        167,
        168,
        168,
        169,
        170,
        172,
        173,
    ]
)

In [21]:
data.sum() / len(data), data.mean(), statistics.mean(data)

(160.375, 160.375, 160)

In [22]:
statistics.mode(data), stats.mode(data)

(160, ModeResult(mode=160, count=5))

In [23]:
odd_data = [150, 151, 152, 152, 153, 154, 155, 155, 155]

position = math.ceil(len(odd_data) / 2)

odd_data[position - 1]

153

In [24]:
position = len(data) // 2

(data[position - 1] + data[position]) / 2

160.0

### Easy way

In [25]:
np.median(odd_data), statistics.median(odd_data)

(153.0, 153)

In [26]:
np.median(data), statistics.median(data)

(160.0, 160.0)

### Weighted Arithmetic Mean

In [27]:
grades = np.array([9, 8, 7, 3])
weights = np.array([1, 2, 3, 4])

np.average(grades, weights=weights), (9 * 1 + 8 * 2 + 7 * 3 + 3 * 4) / (
    1 + 2 + 3 + 4
), (grades * weights).sum() / weights.sum()

(5.8, 5.8, 5.8)

In [28]:
data = {
    "lower": [150, 154, 158, 162, 166, 170],
    "upper": [154, 158, 162, 166, 170, 174],
    "fi": [5, 9, 11, 7, 5, 3],
}

dataset = pd.DataFrame(data)

dataset

   lower  upper  fi
0    150    154   5
1    154    158   9
2    158    162  11
3    162    166   7
4    166    170   5
5    170    174   3

In [ ]:
dataset["xi"] = (dataset["lower"] + dataset["upper"]) / 2

dataset

   lower  upper  fi     xi
0    150    154   5  152.0
1    154    158   9  156.0
2    158    162  11  160.0
3    162    166   7  164.0
4    166    170   5  168.0
5    170    174   3  172.0

In [ ]:
dataset["fi.xi"] = dataset["fi"] * dataset["xi"]

dataset

   lower  upper  fi     xi   fi.xi
0    150    154   5  152.0   760.0
1    154    158   9  156.0  1404.0
2    158    162  11  160.0  1760.0
3    162    166   7  164.0  1148.0
4    166    170   5  168.0   840.0
5    170    174   3  172.0   516.0

In [ ]:
dataset["Fi"] = 0

dataset

   lower  upper  fi     xi   fi.xi  Fi
0    150    154   5  152.0   760.0   0
1    154    158   9  156.0  1404.0   0
2    158    162  11  160.0  1760.0   0
3    162    166   7  164.0  1148.0   0
4    166    170   5  168.0   840.0   0
5    170    174   3  172.0   516.0   0

In [ ]:
counter = 0
sum_frequencies = []

for row in dataset.iterrows():
    counter += row[1]["fi"]
    sum_frequencies.append(counter)

dataset["Fi"] = sum_frequencies

dataset

   lower  upper  fi     xi   fi.xi    Fi
0    150    154   5  152.0   760.0   5.0
1    154    158   9  156.0  1404.0  14.0
2    158    162  11  160.0  1760.0  25.0
3    162    166   7  164.0  1148.0  32.0
4    166    170   5  168.0   840.0  37.0
5    170    174   3  172.0   516.0  40.0

#### easy way

In [ ]:
dataset["Fi"] = dataset["fi"].cumsum()

dataset

   lower  upper  fi     xi   fi.xi  Fi
0    150    154   5  152.0   760.0   5
1    154    158   9  156.0  1404.0  14
2    158    162  11  160.0  1760.0  25
3    162    166   7  164.0  1148.0  32
4    166    170   5  168.0   840.0  37
5    170    174   3  172.0   516.0  40

In [ ]:
dataset["fi"].sum(), dataset["fi.xi"].sum()

(40, 6428.0)

In [ ]:
dataset["fi.xi"].sum() / dataset["fi"].sum()

160.7

In [ ]:
dataset["fi"].max(), dataset["fi"].idxmax()

(11, 2)

In [ ]:
dataset[dataset["fi"] == dataset["fi"].max()]

   lower  upper  fi     xi   fi.xi  Fi
2    158    162  11  160.0  1760.0  25

In [ ]:
dataset[dataset["fi"] == dataset["fi"].max()]["xi"].values[0]

160.0

In [48]:
dataset

   lower  upper  fi     xi   fi.xi  Fi
0    150    154   5  152.0   760.0   5
1    154    158   9  156.0  1404.0  14
2    158    162  11  160.0  1760.0  25
3    162    166   7  164.0  1148.0  32
4    166    170   5  168.0   840.0  37
5    170    174   3  172.0   516.0  40

In [ ]:
fi_2 = dataset["fi"].sum() / 2

fi_2

20.0

In [69]:
for row in dataset.iterrows():
    lower_limit = row[1]["lower"]
    class_frequency = row[1]["fi"]
    id_pass_frequency = row[0]

    if fi_2 <= row[1]["Fi"]:
        id_pass_frequency -= 1
        break

id_pass_frequency

1

In [68]:
Fi_past = dataset.iloc[id_pass_frequency]["Fi"]

Fi_past

14.0

In [70]:
median = lower_limit + ((fi_2 - Fi_past) / class_frequency) * 4

median

160.1818181818182